[
    {
        "name": "Asteroids-JS",
        "skills": [
            "TypeScript",
            "Javascript",
            "Webpack"
        ],
        "image": "asteroids-js.png",
        "github": "https://github.com/Alchamyst/asteroids-js",
        "liveUrl": "https://alchamyst.github.io/asteroids-js/",
        "description1": "My own take on the classic Asteroids game, employing pure JavaScript initially and subsequently implementing Webpack for code minification, optimising the loading process for web browsers.",
        "description2": "In the course of this project, I expanded my skill set by incorporating TypeScript. This involved reconfiguring the original code into modular components, establishing a robust core game codebase that could serve as a base in future game projects."
    },
    {
        "name": "Weather Wingman",
        "skills": [
            "Javascript",
            "Node.js",
            "React",
            "Vite"
        ],
        "image": "weather-wingman.png",
        "github": "https://github.com/Alchamyst/alchamyst-weather-app",
        "liveUrl": "https://weather.alchamyst.com/",
        "description1": "Responsive web app that provides location-based weather forecasting. A front-end React app with a Node.js back-end server which handles the fetching of data from 3rd party APIs. Users can get the weather of a location by searching for a city, postcode, or full/partial address.",
        "description2": "The search query is utilised to fetch data from an external API, retrieving the longitude and latitude of the closest matching location. Subsequently, this longitude and latitude data is used to query a separate API for the weather information displayed by the front-end app."
    },
    {
        "name": "Portfolio Website",
        "skills": [
            "Javascript",
            "Node.js",
            "React",
            "Vite"
        ],
        "image": "alchamyst-portfolio.png",
        "github": "https://github.com/Alchamyst/ayetman-web",
        "liveUrl": "https://www.alchamyst.com",
        "description1": "The website you are currently exploring is the product of this project. Designed to adapt seamlessly to diverse devices and screens, it leverages technologies like React and Flex CSS and reflects my web development skills.",
        "description2": "Of particular note, this project also marked my introduction to 'Vite', a frontend build tool akin to Webpack, which I found the experience to be thoroughly enjoyable."
    },
    {
        "name": "Task Manager API",
        "skills": [
            "Javascript",
            "Node.js",
            "Jest",
            "MongoDB"
        ],
        "image": "task-manager-api.png",
        "github": "https://github.com/Alchamyst/task-manager-api",
        "liveUrl": "",
        "description1": "As part of my exploration of JSON and RESTful APIs, I set out to build an Express web server hosting a 'task manager' API. This project involved creating two distinct API routes—one for user management and authentication, and another for task management. Task-related actions were limited to logged-in users, enabling them to create, query, edit, and delete tasks.",
        "description2": "User and task data were securely stored through MongoDB, while jsonwebtoken was employed to validate login sessions. Rigorous testing was conducted using the 'Postman' desktop application, as depicted in the accompanying screenshot."
    }
]